app/Controllers/Csv.php

    public function view($date)
    {
        if(isset($date) && $date != ''){
            $date = explode('|',$date);
            $startdate = date('Y-m-d',strtotime($date[0]));
            $enddate = date('Y-m-d',strtotime($date[1]));
        }else{
            $mindate = $this->db->table('csv')->selectMin('date')->get(1)->getResultArray();
            $maxdate = $this->db->table('csv')->selectMax('date')->get(1)->getResultArray();
            $startdate = $mindate[0]['date'];
            $enddate = $maxdate[0]['date'];
        }
        $data['result'] = $this->db->table('csv')->where('is_deleted','0')->where('date >=',$startdate)->where('date <=',$enddate)->get()->getResultArray();
---
SELECT MIN(`date`) AS `date`
FROM `csv`
 LIMIT 1
SELECT MAX(`date`) AS `date`
FROM `csv`
 LIMIT 1
SELECT *
FROM `csv`
WHERE `is_deleted` = '0'
AND `date` >= '2023-02-03'
AND `date` <= '2023-02-23'

    public function file_upload()
    {
        $file = $this->request->getFile('file');
        if(is_file("public/uploads/test.csv")){
            unlink("public/uploads/test.csv");
        }
        $file->move(ROOTPATH . 'public/uploads/', 'test.csv');
        $arr = array(array(), array());
        $num = 0;
        $row = 0;
        $handle = fopen("public/uploads/test.csv", "r");

        //remove all commas
        while ($data = fgetcsv($handle, 1000, ",")) {
            $num = count($data);
            for ($c = 0; $c < $num; $c++) {
                $str = str_replace(',', ' ', $data[$c]);
                $arr[$row][$c] = $str;
            }
            $row++;
        }

        for($k = 1; $k < count($arr); $k++){
            //image resolution
            list($width, $height) = getimagesize($arr[$k][0]);
            $bad_image = '0';
            if($width < 400 || $height < 500){
                $bad_image = '1';
            }
            //sku check
            $sku_check = $this->db->table('csv')->where('sku',$arr[$k][2])->where('is_deleted','0')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `csv`
WHERE `sku` = '123'
AND `is_deleted` = '0'

                'repeated_sku' => $sku_repeat,
                'bad_image' => $bad_image,
            );
            $this->db->table('csv')->insert($data);
---
INSERT INTO `csv` (`image`, `name`, `sku`, `price`, `date`, `repeated_sku`, `bad_image`) VALUES ('https://pe-images.s3.amazonaws.com/essentials/image-quality/low-res-horse.jpg', 'rohaan', '123', '1', '2023-02-18', '1', '1')