app/Controllers/Csv.php

    public function view()
    {
        $data['result'] = $this->db->table('csv')->where('is_deleted','0')->get()->getResultArray();
---
SELECT *
FROM `csv`
WHERE `is_deleted` = '0'