app/Controllers/Download.php

    function download_csv(){
        $startdate = $_POST['startdate'];
        $enddate = $_POST['enddate'];
        $startdate = date('Y-m-d',strtotime($startdate));
        $enddate = date('Y-m-d',strtotime($enddate));
        $csv = $this->db->table('csv')->select('image,name,sku,price,date')->where('is_deleted','0')->where('is_approved','1')->where('date >=',$startdate)->where('date <=',$enddate)->get()->getResultArray();
---
SELECT `image`, `name`, `sku`, `price`, `date`
FROM `csv`
WHERE `is_deleted` = '0'
AND `is_approved` = '1'
AND `date` >= '2023-02-01'
AND `date` <= '2023-02-28'