app/Controllers/Fileupload.php

SELECT *
FROM `restrictions`
WHERE `id` = '1'
 LIMIT 1
---
    public function file_upload()
    {
        $file = $this->request->getFile('file');
        if(is_file("public/uploads/test.csv")){
            unlink("public/uploads/test.csv");
        }

        $file->move(ROOTPATH . 'public/uploads/', 'test.csv');

        $data_res = $this->db->table('restrictions')->where('id', '1')->get(1)->getResultArray();

SELECT *
FROM `statistics`
WHERE `id` = '1'
 LIMIT 1
---
        }

        // stats
        $statistics = $this->db->table('statistics')->where('id', '1')->get(1)->getResultArray();

UPDATE `statistics` SET `filter_words` = 35, `filter_times` = 11
WHERE `id` = '1'
---
            'filter_words' => $errors + $statistics[0]['filter_words'],
            'filter_times' => $statistics[0]['filter_times'] + 1,
        );
        $this->db->table('statistics')->set($stats)->where('id', '1')->update();