app/Controllers/Keyword.php

    public function view()
    {
        $data['update'] = $this->db->table('restrictions')->where('id','1')->get(1)->getResultArray();
---
SELECT *
FROM `restrictions`
WHERE `id` = '1'
 LIMIT 1