app/Controllers/Login.php

UPDATE `credentials` SET `lastlogin` = '2023-02-20 16:20:23'
WHERE `email` = 'rohaan@ibhejo.com'
---
    public function Auth(){
        helper('cookie');
        $pass = md5($_POST['password']);
        $data = array(
            'email' => $_POST['username'],
            'password' => $pass,
        );
        $time = array(
            'lastlogin'=> date('Y-m-d H:i:s')
        );
        $count = $this->db->table('credentials')->where($data)->countAllResults();
        if($count == 0){
            $result['result'] = '200';
        }else{
            $result['result'] = '400';
            $this->session->set('username',$_POST['username']);
            if($_POST['rememberme'] == 'on'){
                set_cookie('email',$_POST['username'],'0');
                set_cookie('password',$_POST['password'],'0');
            }else{
                delete_cookie('email');
                delete_cookie('password');
            }
            $this->db->table('credentials')->set($time)->where('email',$_POST['username'])->update();