app/Controllers/Usermenu.php

SELECT *
FROM `credentials`
---
    public function view()
    {
        $data['result'] = $this->db->table('credentials')->get()->getResultArray();