app/Views/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `csv`
SELECT COUNT(*) AS `numrows`
FROM `csv`
WHERE `is_approved` = '1'
SELECT COUNT(*) AS `numrows`
FROM `csv`
WHERE `is_approved` = '0'
---
</head>
<?php
$db = db_connect();
$total = $db->table('csv')->countAllResults();
$approved = $db->table('csv')->where('is_approved','1')->countAllResults();
$unapproved = $db->table('csv')->where('is_approved','0')->countAllResults();